app/controllers/kanjis_controller.rb

SELECT "kanjis".* FROM "kanjis"
---
  def index
    @kanjis = Kanji.all

INSERT INTO "kanjis" ("kanji", "kakusu", "yomi", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["kanji", "亜"], ["kakusu", 7], ["yomi", "ア"], ["created_at", "2016-02-13 07:39:41.619952"], ["updated_at", "2016-02-13 07:39:41.619952"]]
---
  def create
    @kanji = Kanji.new(kanji_params)

    respond_to do |format|
      if @kanji.save

SELECT "kanjis".* FROM "kanjis" WHERE "kanjis"."kanji" = ?  [["kanji", "あ"]]
---
  def search
    @kanjis = Kanji.where("kanji = ? and yomi = ?", params[:kanji], params[:yomi])

SELECT  "kanjis".* FROM "kanjis" WHERE "kanjis"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_kanji
      @kanji = Kanji.find(params[:id])