app/controllers/sessions_controller.rb

INSERT INTO "users" ("provider", "uid", "name", "image", "token", "secret") VALUES (?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? LIMIT 1  [["provider", "twitter"], ["uid", "4900130930"]]
---
  def create
    user = User.find_by(provider: auth[:provider], uid: auth[:uid]) || User.create_from_auth!(auth)